{
  "missedOpportunities": {
    "lessons": [
      "Sometimes not getting a chance is life's way of redirecting you to something better.",
      "One closed door does not define your entire journey.",
      "You can be fully prepared and still not get the chance; life works on its own timing.",
      "Everything you learn in preparation will still help you later.",
      "When something doesn't happen, something else is being prepared for you."
    ],
    "examples": [
      "MS Dhoni was not selected in the Kolkata trials but became India's legendary captain.",
      "Amitabh Bachchan was rejected by All India Radio for his voice, now it's iconic.",
      "Michael Jordan was cut from his school basketball team before becoming the GOAT.",
      "Shah Rukh Khan faced multiple rejections before becoming a global superstar.",
      "Oprah Winfrey was fired from her first TV job but later became a media icon."
    ]
  },

  "failureAfterHardWork": {
    "lessons": [
      "Failure is not the opposite of success; it's a part of the journey.",
      "Effort never goes to waste; it shapes your future success.",
      "Every major success story has a 'failure phase' before the breakthrough.",
      "Hard work builds character even when the result doesn't show immediately.",
      "Setbacks prepare you for a stronger comeback."
    ],
    "examples": [
      "J.K. Rowling faced 12 rejections before Harry Potter became a phenomenon.",
      "Thomas Edison failed over 1,000 times before inventing the light bulb.",
      "APJ Abdul Kalam faced repeated setbacks before becoming the Missile Man of India.",
      "Walt Disney was told he lacked creativity before building his empire.",
      "Sachin Tendulkar failed many times early on but became a cricket legend."
    ]
  },

  "feelingLost": {
    "lessons": [
      "You don't need to have everything figured out right now.",
      "Clarity often comes after taking small steps.",
      "Feeling lost is a sign you're transitioning to a new version of yourself.",
      "It's okay to explore — every great journey starts uncertain.",
      "Purpose is discovered, not assigned."
    ],
    "examples": [
      "Steve Jobs dropped out of college and wandered before creating Apple.",
      "Oprah went through poverty and confusion before finding her path.",
      "Elon Musk switched fields multiple times before Tesla and SpaceX.",
      "Keanu Reeves struggled through loss and uncertainty yet built a meaningful life.",
      "Emma Watson took a break to rediscover herself after early fame."
    ]
  },

  "rejection": {
    "lessons": [
      "Rejection is redirection toward something better.",
      "What is meant for you will never require you to shrink yourself.",
      "Not being chosen doesn’t reduce your worth.",
      "Every rejection teaches resilience.",
      "Sometimes you need a 'no' before the biggest 'yes' of your life."
    ],
    "examples": [
      "Colonel Sanders heard over 1,000 no's before KFC succeeded.",
      "Shah Rukh Khan was rejected by many producers before rising to superstardom.",
      "Virat Kohli faced selection setbacks early in his career.",
      "Ariana Grande’s early career saw many rejections before fame.",
      "Stephen King’s first book 'Carrie' was rejected 30 times."
    ]
  },

  "breakupOrEmotionalPain": {
    "lessons": [
      "Healing takes time, and that's perfectly okay.",
      "Loss creates space for a better version of you.",
      "Pain doesn't stay forever; it transforms you.",
      "Heartbreak is proof that you have the courage to feel deeply.",
      "You grow the most during emotionally tough seasons."
    ],
    "examples": [
      "Selena Gomez transformed heartbreak into self-love and advocacy.",
      "Ariana Grande wrote healing music after emotional pain.",
      "Katy Perry rebuilt her life after a difficult divorce.",
      "Hrithik Roshan bounced back stronger after personal struggles.",
      "Jennifer Lopez rebuilt her confidence after multiple heartbreaks."
    ]
  },

  "stressOrBurnout": {
    "lessons": [
      "Rest is productive and necessary.",
      "You are human — it’s okay to slow down.",
      "Your worth is not measured by constant output.",
      "Taking a break can save you from breakdown.",
      "You are allowed to breathe, pause, and reset."
    ],
    "examples": [
      "Simone Biles stepped back for mental health during the Olympics.",
      "Deepika Padukone openly discussed depression and inspired many.",
      "Emma Chamberlain took a break from YouTube to protect her mental peace.",
      "Justin Bieber paused his career to focus on well-being.",
      "Zayn Malik left One Direction due to stress and found new strength."
    ]
  },

  "selfDoubt": {
    "lessons": [
      "Confidence grows with action, not perfection.",
      "You are allowed to believe in yourself even when unsure.",
      "Self-doubt doesn't mean you’re not capable.",
      "Every expert was once a beginner.",
      "Your value doesn’t decrease when you feel insecure."
    ],
    "examples": [
      "Emma Watson struggled with impostor syndrome before becoming a global activist.",
      "Dwayne Johnson was cut from the CFL but later became an icon.",
      "Lady Gaga battled self-doubt early in her career.",
      "Ed Sheeran was told he couldn't sing before becoming a superstar.",
      "Virat Kohli admitted to battling anxiety but kept pushing forward."
    ]
  },

  "careerConfusion": {
    "lessons": [
      "It's okay to change paths — your career can evolve.",
      "Your first job is not your final destiny.",
      "Exploration helps you discover what you truly want.",
      "Success doesn’t have one fixed route.",
      "You’re allowed to outgrow old dreams."
    ],
    "examples": [
      "Jeff Bezos left finance to build Amazon.",
      "Sundar Pichai shifted fields multiple times before leading Google.",
      "Katrina Kaif moved from modelling to acting successfully.",
      "Nawazuddin Siddiqui struggled for years before rising in films.",
      "Jack Ma started Alibaba at 35 after failing many times."
    ]
  },

  "examStress": {
    "lessons": [
      "Marks don't define your future success.",
      "Exams are important, but they don't measure your intelligence.",
      "Preparing sincerely matters more than the result.",
      "You can always try again — nothing ends here.",
      "One exam cannot decide your destiny."
    ],
    "examples": [
      "Albert Einstein was not a top student but changed science forever.",
      "Sachin Tendulkar wasn’t academically strong but became a legend.",
      "Kiran Bedi overcame early academic struggles to become a top IPS officer.",
      "Akshay Kumar was average in studies but excelled through discipline.",
      "Nandan Nilekani (Infosys) struggled early but rose through hard work."
    ]
  },

  "loneliness": {
    "lessons": [
      "Being alone doesn't mean you're unloved.",
      "Sometimes loneliness is part of growth.",
      "You are becoming someone stronger and more aware.",
      "It’s okay to outgrow old friends and environments.",
      "Solitude can help you find yourself."
    ],
    "examples": [
      "Keanu Reeves lived through loneliness but remained compassionate.",
      "Taylor Swift wrote some of her best music during lonely phases.",
      "Sushant Singh Rajput came from a humble background and fought through isolation.",
      "Zayn Malik built a solo career after leaving a group.",
      "Billie Eilish wrote her first hits while feeling isolated."
    ]
  },

  "startingSomethingNew": {
    "lessons": [
      "Everything new feels scary at first.",
      "Courage is moving forward even when you're afraid.",
      "You don’t need to be perfect to begin.",
      "Every master was once a beginner.",
      "Small first steps can change your entire life."
    ],
    "examples": [
      "Neeraj Chopra took a risk after injury and became an Olympic champion.",
      "Priyanka Chopra moved to Hollywood with uncertainty and succeeded.",
      "Jack Ma started Alibaba despite many failures.",
      "Amitabh Bachchan rebuilt his career through television when films slowed down.",
      "Elon Musk took huge risks starting Tesla and SpaceX."
    ]
  }
}
